---
kind: type
id: T:Autodesk.Revit.DB.AssemblyDifference
source: html/51d7603f-be85-5d67-eeb1-7cd7a6d199a8.htm
---
# Autodesk.Revit.DB.AssemblyDifference

Class that describes difference between two assemblies.

## Syntax (C#)
```csharp
public class AssemblyDifference : IDisposable
```

## Remarks
The assembly comparison function returns a sub-class of this class.
 Different sub-classes represent different kinds of differences and contain
 additional data for each particular kind of difference.